---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RebarShapeHookRotationAtStart
source: html/ca790703-13a6-8dc2-57af-154c0ce52cf1.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RebarShapeHookRotationAtStart Property

"Hook Rotation At Start"

## Syntax (C#)
```csharp
public static ForgeTypeId RebarShapeHookRotationAtStart { get; }
```